docs/images/dependencies.dot
digraph {
    fontname="Helvetica,Arial,sans-serif"
                node [
                    style=filled
                    shape=box
                    fontname="Helvetica,Arial,sans-serif"
                    fontsize=10
                    color="#b2afa7"
                    fillcolor="#edeceb"
                ]
                edge [
                    headport=nw
                    fontname="Helvetica,Arial,sans-serif"
                    fontsize=8
                    color="#b2b1ae"
                    fontcolor="#00000080"
                ]
    "markdown-it-py" -> mdurl [label="~=0.1"]
    "markdown-it-py" [label="markdown-it-py\n2.1.0"]
    "pelican-webassets" -> pelican [label=">=4.5,<5.0"]
    "pelican-webassets" -> webassets [label=">=2.0,<3.0"]
    "pelican-webassets" [label="pelican-webassets\n2.0.0"]
    "pymdown-extensions" -> markdown [label=">=3.2"]
    "pymdown-extensions" [label="pymdown-extensions\n9.9.2"]
    "python-dateutil" -> six [label=">=1.5"]
    "python-dateutil" [label="python-dateutil\n2.8.2"]
    blinker [label="blinker\n1.5"]
    closure [label="closure\n20191111"]
    cssmin [label="cssmin\n0.2.0"]
    cssselect [label="cssselect\n1.2.0"]
    docutils [label="docutils\n0.19"]
    feedgenerator -> pytz [label=">=0a"]
    feedgenerator [label="feedgenerator\n2.0.0"]
    jinja2 -> markupsafe [label=">=2.0"]
    jinja2 [label="Jinja2\n3.1.2"]
    libsass [label="libsass\n0.22.0"]
    lxml [label="lxml\n4.9.2"]
    markdown [label="Markdown\n3.4.1"]
    markupsafe [label="MarkupSafe\n2.1.2"]
    mdurl [label="mdurl\n0.1.2"]
    pelican -> "python-dateutil" [label=">=2.8"]
    pelican -> blinker [label=">=1.4"]
    pelican -> docutils [label=">=0.16"]
    pelican -> feedgenerator [label=">=1.9"]
    pelican -> jinja2 [label=">=2.7"]
    pelican -> pygments [label=">=2.6"]
    pelican -> pytz [label=">=2020.1"]
    pelican -> rich [label=">=10.1"]
    pelican -> unidecode [label=">=1.1"]
    pelican [label="pelican\n4.8.0"]
    plumage -> "pelican-webassets" [label=">=2.0.0,<3.0.0"]
    plumage -> "pymdown-extensions" [label=">=9.9.2,<10.0.0"]
    plumage -> closure [label=">=20191111,<20191112"]
    plumage -> cssmin [label=">=0.2.0,<0.3.0"]
    plumage -> libsass [label=">=0.22.0,<0.23.0"]
    plumage -> markdown [label=">=3.4.1,<4.0.0"]
    plumage -> pelican [label=">=4.8.0,<5.0.0"]
    plumage -> pygments [label=">=2.14.0,<3.0.0"]
    plumage -> pynpm [label=">=0.1.2,<0.2.0"]
    plumage -> pyquery [label=">=2.0.0,<3.0.0"]
    plumage [label="plumage\n3.0.0"]
    pygments [label="Pygments\n2.14.0"]
    pynpm [label="pynpm\n0.1.2"]
    pyquery -> cssselect [label=">=1.2.0"]
    pyquery -> lxml [label=">=2.1"]
    pyquery [label="pyquery\n2.0.0"]
    pytz [label="pytz\n2022.7.1"]
    rich -> "markdown-it-py" [label=">=2.1.0,<3.0.0"]
    rich -> pygments [label=">=2.14.0,<3.0.0"]
    rich [label="rich\n13.3.1"]
    six [label="six\n1.16.0"]
    unidecode [label="Unidecode\n1.3.6"]
    webassets [label="webassets\n2.0"]
}
